configuration/DataProcessors/_РазличныеПромты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>_РазличныеПромты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

configuration/InformationRegisters/_СостояниеКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостояниеКарточек</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_Элемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Catalogs/_ВидыКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_ВидыКарточек</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
								<v8:Type>cfg:EnumRef._СпособыХранениеРеквизитовКарточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизитаВХранении</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеДействие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФункциональнаяРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтображаемыеГруппыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппыКоманд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки_родители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/DataProcessors/_РазличныеПромты/Ext/ObjectModule.bsl
// ---------------------------------------------------------------------------
// Служебная процедура подготовки временных таблиц
// ФильтрВидовРеквизитов - Массив (ПланВидовХарактеристикСсылка._ВидыРеквизитов). 
//    Если задан, в результат попадут только указанные виды реквизитов.
// ---------------------------------------------------------------------------
Процедура ПолучитьСостояние_ПодготовитьМенеджерВременныхТаблиц(ВидКарточки, МассивКарточек, ОтборыПоРеквизитам, МенеджерВременныхТаблиц, ФильтрВидовРеквизитов = Неопределено)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ВидКарточки", ВидКарточки);
	
	// Условие фильтрации реквизитов
	УсловиеФильтра = "";
	Если ФильтрВидовРеквизитов <> Неопределено И ФильтрВидовРеквизитов.Количество() > 0 Тогда
		ПараметрыЗапроса.Вставить("ФильтрВидовРеквизитов", ФильтрВидовРеквизитов);
		УсловиеФильтра = " И Реквизиты.ВидРеквизита В (&ФильтрВидовРеквизитов)";
	КонецЕсли;
	
	ТекстЗапроса = "";
	ТекстЗапросаНаУдалениеСлужебныхТаблиц = "";
	
	// 1. Шаблон реквизитов вида карточки (с учетом фильтра)
	ТекстЗапроса = ТекстЗапроса + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК ВидКарточки,
	|	Реквизиты.ВидРеквизита КАК ВидРеквизита,
	|	Реквизиты.Хранение КАК Хранение
	|ПОМЕСТИТЬ ВТ_Реквизиты
	|ИЗ
	|	Справочник._ВидыКарточек.Реквизиты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ВидКарточки" + УсловиеФильтра + "
	|;
	|";
	
	// 2. Начальная таблица карточек
	Если МассивКарточек.Количество() > 0 Тогда
		ПараметрыЗапроса.Вставить("МассивКарточек", МассивКарточек);
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	_Карточки.Ссылка КАК Карточка
		|ПОМЕСТИТЬ ВТ_Карточки
		|ИЗ
		|	Справочник._Карточки КАК _Карточки
		|ГДЕ
		|	_Карточки.Ссылка В (&МассивКарточек)
		|;
		|";
		ИмяТаблицыКарточек = "ВТ_Карточки";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 Карточка КАК Карточка
		|ПОМЕСТИТЬ ВТ_КарточкиОтбора_0
		|ИЗ РегистрСведений._СостояниеКарточек.СрезПоследних КАК Регистр
		|;
		|";
		ИмяТаблицыКарточек = "ВТ_КарточкиОтбора_0";
	КонецЕсли;
	
	// 3. Отбор по значениям реквизитов (пересечение по И)
	Если ОтборыПоРеквизитам.Количество() > 0 Тогда
		Сч = 0;
		Для каждого ОтборПоРеквизиту ИЗ ОтборыПоРеквизитам Цикл
			Сч = Сч + 1;
			СчТек = Формат(Сч, "ЧГ=0");
			СчПред = Формат(Сч - 1, "ЧГ=0");
			
			ПараметрыЗапроса.Вставить("ВидРеквизита" + СчТек, ОтборПоРеквизиту.Ключ);
			ПараметрыЗапроса.Вставить("ЗначениеРеквизита" + СчТек, ОтборПоРеквизиту.Значение);
			
			ИмяТек = "ВТ_КарточкиОтбора_" + СчТек;
			ИмяПред = "ВТ_КарточкиОтбора_" + СчПред;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	Регистр.Карточка КАК Карточка
			|ПОМЕСТИТЬ " + ИмяТек + "
			|ИЗ
			|	РегистрСведений._СостояниеКарточек.СрезПоследних(, ВидРеквизита = &ВидРеквизита" + СчТек + ") КАК Регистр";
			
			Если Сч > 1 Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ИмяПред + " КАК Предыдущая
				|	ПО (Предыдущая.Карточка = Регистр.Карточка)";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	Регистр.ЗначениеРеквизита = &ЗначениеРеквизита" + СчТек + "
			|;
			|";
			
			ТекстЗапросаНаУдалениеСлужебныхТаблиц = ТекстЗапросаНаУдалениеСлужебныхТаблиц + "
			|УНИЧТОЖИТЬ " + ИмяТек + ";";
			
			ИмяТаблицыКарточек = ИмяТек;
		КонецЦикла;
	КонецЕсли;
	
	// 4. Итоговая матрица карточка × реквизит
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	" + ИмяТаблицыКарточек + ".Карточка,
	|	ВТ_Реквизиты.ВидКарточки КАК ВидКарточки,
	|	ВТ_Реквизиты.ВидРеквизита КАК ВидРеквизита
	|ПОМЕСТИТЬ ВТ_КарточкиОтбораИтог
	|ИЗ
	|	" + ИмяТаблицыКарточек + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реквизиты
	|		ПО (ИСТИНА)
	|;
	|";
	
	УсловиеСреза = "Карточка В (ВЫБРАТЬ Карточка ИЗ ВТ_КарточкиОтбораИтог)";
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ВТ_КарточкиОтбораИтог.Карточка КАК Карточка,
	|	ВТ_КарточкиОтбораИтог.ВидРеквизита КАК ВидРеквизита,
	|	Регистр.УИД_Элемента КАК УИД_Элемента,
	|	Регистр.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек
	|ИЗ
	|	ВТ_КарточкиОтбораИтог КАК ВТ_КарточкиОтбораИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СостояниеКарточек.СрезПоследних(, " + УсловиеСреза + ") КАК Регистр
	|		ПО ВТ_КарточкиОтбораИтог.Карточка = Регистр.Карточка
	|		 И ВТ_КарточкиОтбораИтог.ВидРеквизита = Регистр.ВидРеквизита
	|;
	|";
	
	// 5. Выполнение + очистка промежуточных таблиц
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Для Каждого Пар Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Пар.Ключ, Пар.Значение);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса + ТекстЗапросаНаУдалениеСлужебныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

// ---------------------------------------------------------------------------
// Основная функция
// ---------------------------------------------------------------------------
Функция ПолучитьСостояние(ВидКарточки = Неопределено, Отбор = Неопределено, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	// 0. Инициализация менеджера
	Если Не ТипЗнч(МенеджерВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	// 1. Разбор отбора
	МассивКарточек = Новый Массив;
	ОтборыПоРеквизитам = Новый Соответствие;
	Если Отбор <> Неопределено Тогда
		Для Каждого КлючЗнач Из Отбор Цикл
			Если КлючЗнач.Ключ = "Карточка" И ТипЗнч(КлючЗнач.Значение) = Тип("СправочникСсылка._Карточки") Тогда
				Если МассивКарточек.Найти(КлючЗнач.Значение) = Неопределено Тогда
					МассивКарточек.Добавить(КлючЗнач.Значение);
				КонецЕсли;
			ИначеЕсли КлючЗнач.Ключ = "Карточки" И ТипЗнч(КлючЗнач.Значение) = Тип("Массив") Тогда
				Для Каждого Карта Из КлючЗнач.Значение Цикл
					Если МассивКарточек.Найти(Карта) = Неопределено Тогда
						МассивКарточек.Добавить(Карта);
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(КлючЗнач.Ключ) = Тип("ПланВидовХарактеристикСсылка._ВидыРеквизитов") Тогда
				ОтборыПоРеквизитам.Вставить(КлючЗнач.Ключ, КлючЗнач.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидКарточки = Неопределено И МассивКарточек.Количество() > 0 Тогда
		ВидКарточки = МассивКарточек[0].ВидКарточки;
	КонецЕсли;
	Если ВидКарточки = Неопределено Тогда
		ВызватьИсключение "Не задан и не может быть определен параметр ВидКарточки.";
	КонецЕсли;
	
	// 2.1 Получение основных реквизитов карточки
	ПолучитьСостояние_ПодготовитьМенеджерВременныхТаблиц(ВидКарточки, МассивКарточек, ОтборыПоРеквизитам, МенеджерВременныхТаблиц);
	
	// 2.2 Сохранение результатов уровня 0
	ЗапросСохранения0 = Новый Запрос;
	ЗапросСохранения0.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросСохранения0.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Значения_Ур0 ИЗ ВТ_ЗначенияРеквизитовКарточек;
	|УНИЧТОЖИТЬ ВТ_ЗначенияРеквизитовКарточек;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Реквизиты_Ур0 ИЗ ВТ_Реквизиты;
	|УНИЧТОЖИТЬ ВТ_Реквизиты;";
	ЗапросСохранения0.Выполнить();
	
	МассивТаблицЗначений = Новый Массив;
	МассивТаблицЗначений.Добавить("ВТ_Значения_Ур0");
	
	// 2.3 - 2.5 Получение вложенных значений (только если указана одна карточка)
	Если МассивКарточек.Количество() = 1 Тогда
		Для Уровень = 1 По 3 Цикл
			ИмяТабПредыдущего = "ВТ_Значения_Ур" + (Уровень - 1);
			ИмяТабСтруктурыПредыдущего = "ВТ_Реквизиты_Ур" + (Уровень - 1);
			
			//  Ищем ссылки только в тех реквизитах, у которых Хранение = ПВХ (т.е. указатель на другую карточку)
			ЗапросСсылок = Новый Запрос;
			ЗапросСсылок.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросСсылок.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Знач.ЗначениеРеквизита КАК СсылкаНаКарточку,
			|	Карточка.ВидКарточки КАК ВидКарточки
			|ПОМЕСТИТЬ ВТ_СсылкиДляУровня
			|ИЗ
			|	" + ИмяТабПредыдущего + " КАК Знач
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ИмяТабСтруктурыПредыдущего + " КАК Струк
			|		ПО Знач.ВидРеквизита = Струк.ВидРеквизита
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._Карточки КАК Карточка
			|		ПО Знач.ЗначениеРеквизита = Карточка.Ссылка
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(Знач.ЗначениеРеквизита) = ТИП(СправочникСсылка._Карточки)
			|	И ТИПЗНАЧЕНИЯ(Струк.Хранение) = ТИП(ПланВидовХарактеристикСсылка._ВидыРеквизитов);";
			ЗапросСсылок.Выполнить();
			
			// Проверка наличия ссылок без двойного выполнения
			ЗапросПроверки = Новый Запрос;
			ЗапросПроверки.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросПроверки.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 СсылкаНаКарточку ИЗ ВТ_СсылкиДляУровня";
			Если ЗапросПроверки.Выполнить().Пустой() Тогда
				ЗапросОчСсылки = Новый Запрос; ЗапросОчСсылки.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				ЗапросОчСсылки.Текст = "УНИЧТОЖИТЬ ВТ_СсылкиДляУровня";
				ЗапросОчСсылки.Выполнить();
				Прервать;
			КонецЕсли;
			
			// Группируем найденные ссылки по ВидамКарточек
			КартаВидов = Новый Соответствие;
			ВыборкаСсылок = ЗапросСсылок.Выполнить().Выбрать();
			Пока ВыборкаСсылок.Следующий() Цикл
				Вид = ВыборкаСсылок.ВидКарточки;
				Ссылка = ВыборкаСсылок.СсылкаНаКарточку;
				Если КартаВидов.Получить(Вид) = Неопределено Тогда
					КартаВидов.Вставить(Вид, Новый Массив);
				КонецЕсли;
				КартаВидов.Получить(Вид).Добавить(Ссылка);
			КонецЦикла;
			
			Если КартаВидов.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			// Создаем целевые таблицы для текущего уровня (пустые)
			ИмяТабТекущего = "ВТ_Значения_Ур" + Уровень;
			ИмяТабСтруктурыТекущего = "ВТ_Реквизиты_Ур" + Уровень;
			ЗапросСоздания = Новый Запрос; ЗапросСоздания.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросСоздания.Текст = "
			|ВЫБРАТЬ * ПОМЕСТИТЬ " + ИмяТабТекущего + " ИЗ " + ИмяТабПредыдущего + " ГДЕ ЛОЖЬ;
			|ВЫБРАТЬ * ПОМЕСТИТЬ " + ИмяТабСтруктурыТекущего + " ИЗ " + ИмяТабСтруктурыПредыдущего + " ГДЕ ЛОЖЬ;";
			ЗапросСоздания.Выполнить();
			МассивТаблицЗначений.Добавить(ИмяТабТекущего);
			
			// Загружаем данные для каждого вида вложенной карточки
			Для Каждого ЭлементКарты Из КартаВидов Цикл
				// Вызываем подготовку. Фильтр видов реквизитов можно передать явно, если нужно ограничить вложенную структуру.
				ПолучитьСостояние_ПодготовитьМенеджерВременныхТаблиц(ЭлементКарты.Ключ, ЭлементКарты.Значение, Новый Соответствие, МенеджерВременныхТаблиц, Неопределено);
				
				// Вставляем полученные значения и структуру в таблицы текущего уровня
				ЗапросВставки = Новый Запрос; ЗапросВставки.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				ЗапросВставки.Текст = "
				|ВСТАВИТЬ В " + ИмяТабТекущего + " (Карточка, ВидРеквизита, УИД_Элемента, ЗначениеРеквизита)
				|ВЫБРАТЬ Карточка, ВидРеквизита, УИД_Элемента, ЗначениеРеквизита ИЗ ВТ_ЗначенияРеквизитовКарточек;
				|
				|ВСТАВИТЬ В " + ИмяТабСтруктурыТекущего + " (ВидКарточки, ВидРеквизита, Хранение)
				|ВЫБРАТЬ ВидКарточки, ВидРеквизита, Хранение ИЗ ВТ_Реквизиты;";
				ЗапросВставки.Выполнить();
				
				// Очищаем менеджер от таблиц подготовки, чтобы не конфликтовать именами на следующей итерации цикла
				ЗапросОчистки = Новый Запрос; ЗапросОчистки.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				ЗапросОчистки.Текст = "УНИЧТОЖИТЬ ВТ_Реквизиты; УНИЧТОЖИТЬ ВТ_ЗначенияРеквизитовКарточек;";
				ЗапросОчистки.Выполнить();
			КонецЦикла;
			
			// Удаляем временную таблицу ссылок текущего уровня
			ЗапросУдалСсылки = Новый Запрос; ЗапросУдалСсылки.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросУдалСсылки.Текст = "УНИЧТОЖИТЬ ВТ_СсылкиДляУровня";
			ЗапросУдалСсылки.Выполнить();
		КонецЦикла;
	КонецЕсли;
	
	// 2.9 Формирование возвращаемого массива (объединяем основной уровень и все вложенные)
	ТекстОбъединения = "";
	Для Инд = 0 По МассивТаблицЗначений.Количество() - 1 Цикл
		Если Инд > 0 Тогда
			ТекстОбъединения = ТекстОбъединения + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;
		ТекстОбъединения = ТекстОбъединения + "ВЫБРАТЬ Карточка, ВидРеквизита, УИД_Элемента, ЗначениеРеквизита ИЗ " + МассивТаблицЗначений[Инд];
	КонецЦикла;
	
	ЗапросРезультата = Новый Запрос;
	ЗапросРезультата.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросРезультата.Текст = ТекстОбъединения + " УПОРЯДОЧИТЬ ПО Карточка, ВидРеквизита";
	Выборка = ЗапросРезультата.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура("Карточка,ВидРеквизита,УИД_Элемента,ЗначениеРеквизита");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		Результат.Добавить(Структура);
	КонецЦикла;
	
	// 2.8 Восстановление основных таблиц для внешнего потребителя
	ЗапросВосстановления = Новый Запрос;
	ЗапросВосстановления.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросВосстановления.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Реквизиты ИЗ ВТ_Реквизиты_Ур0;
	|УНИЧТОЖИТЬ ВТ_Реквизиты_Ур0;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ЗначенияРеквизитовКарточек ИЗ ВТ_Значения_Ур0;
	|УНИЧТОЖИТЬ ВТ_Значения_Ур0;";
	ЗапросВосстановления.Выполнить();
	
	Возврат Результат;
	
КонецФункции
